---
kind: method
id: M:Autodesk.Revit.DB.Document.CanEnableWorksharing
zh: 文档、文件
source: html/5fb244f2-6e43-f1d3-2013-55df4a5157aa.htm
---
# Autodesk.Revit.DB.Document.CanEnableWorksharing Method

**中文**: 文档、文件

Checks if worksharing can be enabled in the document.

## Syntax (C#)
```csharp
public bool CanEnableWorksharing()
```

## Returns
True if worksharing can be enabled in the document, False otherwise.